#!/bin/bash

# طلب إدخال عنوان الـ IP المستهدف
read -p "الرجاء إدخال عنوان الـ IP المستهدف: " ip_address

# الشعار
logo="
______ _____ _____        _     ___________ _____ _____ ___________  
|  _  \  _  /  ___|      | |   |_   _| ___ \_   _|  _  |_   _|  _  \ 
| | | | | | \ `--.       | |     | | | |_/ / | | | | | | | | | | | | 
| | | | | | |`--. \      | |     | | |  __/  | | | | | | | | | | | | 
| |/ /\ \_/ /\__/ /      | |_____| |_| |     | | \ \_/ /_| |_| |/ /  
|___/  \___/\____/       \_____/\___/\_|     \_/  \___/ \___/|___/   
                                                                     
                                                                     
"

# كتابة الشعار
echo "$logo"

# دالة لعمل ping
ping_ip() {
    ping -c 1 $1 > /dev/null
}

# تنفيذ الـ ping بشكل متكرر
while :
do
    ping_ip $ip_address
done